[
  {
    "chapter_id": "chap-en-mate-aritmetica",
    "section_contents": [
      "Numerele naturale, întregi și raționale: operații de bază (adunare, scădere, înmulțire, împărțire), ordinea operațiilor. Proprietăți: comutativitate, asociativitate, distributivitate. Puteri: reguli, exponent negativ și zero. Procente: p% din N = p·N/100, creșteri și scăderi procentuale. Formule: media aritmetică, numărul opus, modul.",
      "Fracții: definiție, simplificare, amplificare, aducere la același numitor. Operații: adunare, scădere, înmulțire, împărțire. Transformări fracție zecimală și ordinara. Compararea fracțiilor. Erori frecvente: uitarea simplificării, confundarea ordinii operațiilor. Verificare: estimare rapidă."
    ]
  },
  {
    "chapter_id": "chap-en-ro-comunicare",
    "section_contents": [
      "Comunicarea este procesul prin care se transmit informații, idei și emoții între persoane. În limbajul comun, comunicarea presupune un emitent (cel care transmite mesajul), un mesaj (conținutul transmis), un canal (mijlocul de transmitere) și un receptor (cel care primește mesajul).\n\nTextul nonliterar este un text care urmărește în primul rând transmiterea de informații, explicații sau argumente, fără să aibă ca scop principal valoarea estetică. Tipuri de texte nonliterare: text informativ (știri, reportaje), text explicativ (manual școlar, articol de enciclopedie), text argumentativ (eseu, editorial), text instructiv (rețetă, manual de utilizare).\n\nNoțiunile cheie pentru analiza textului nonliterar: scopul comunicării (a informa, a convinge, a explica), structura textului (introducere, dezvoltare, concluzie), elementele de limbaj (vocabular, registru – formal/informal), tipul de propoziții (enunțiative, interogative, exclamative).",
      "În practică, textele nonliterare se întâlnesc zilnic: la școală (manualele, textele din teste), în presă (articole, știri), în comunicarea oficială (formulare, cereri). La analiză, identifică tipul de text, scopul autorului și mijloacele lingvistice folosite.\n\nExemple: un text de manual care explică un fenomen științific are structură explicativă și limbaj precis; un editorial încearcă să convingă cititorul și folosește argumente și emoții; o rețetă culinară are structură instructivă, cu verbe la imperativ și pași numerotați.\n\nAplicații utile: citește cu atenție enunțul pentru a identifica tipul de text; urmărește ideea principală și argumentele; observă cum autorul organizează informația (titluri, paragrafe, liste)."
    ]
  },
  {
    "chapter_id": "chap-bac-ro-genuri",
    "section_contents": [
      "Genurile literare sunt diviziunile principale ale literaturii. Cele trei genuri fundamentale sunt: epic (narațiune), liric (expresie emoțională, subiectivă) și dramatic (dialog, acțiune scenică).\n\nEpic – cuprinde romanul, nuvela, povestirea, basmul, povestea. Caracteristici: narațiune, personaje, acțiune, spațiu și timp. Poezia epică: baladă, poem, epopee.\n\nLiric – exprimă stări interioare, emoții, reflecții. Specii: poezie lirică (sonet, elegie, odă, satiră), poezie dramatică (monolog interior).\n\nDramatic – destinat reprezentării scenice. Specii: tragedie, comedie, dramă, tragicomedie. Elemente: dialog, acțiune, conflict, personaje.\n\nTrăsături definitorii: fiecare gen are convenții proprii, limbaj specific și funcții estetice distincte. Exemple canonice: Ion (epic), Luceafărul (liric), O scrisoare pierdută (dramatic).",
      "Speciile literare sunt subdiviziunile genurilor. Epic: roman (realist, modern, postmodern), nuvelă, povestire, basm, poveste, epopee, baladă. Liric: sonet, elegie, odă, satiră, epigramă, madrigal. Dramatic: tragedie (clasică, modernă), comedie (de caracter, de situație), dramă, tragicomedie.\n\nExemple: roman – Ion, Ultima noapte; nuvelă – Moara cu noroc; sonet – Luceafărul; comedie – O scrisoare pierdută. Termeni cheie: specie, convenție, formă fixă, structură. La BAC: identificarea genului și speciei, analiza trăsăturilor specifice, relația cu tema și mesajul."
    ]
  }
]
